app/controllers/api/albums_controller.rb

INSERT INTO "albums" ("title", "event_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "klafsdf"], ["event_date", "2021-09-07"], ["user_id", 1], ["created_at", "2021-09-06 15:15:29.723701"], ["updated_at", "2021-09-06 15:15:29.723701"]]
---
  def create
    @album = current_user.albums.new(album_params)

    if @album.save

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def show
    @album = Album.includes(:subalbums, :photos).find(params[:id])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def must_be_album_owner
      if current_user != Album.find(params[:id]).owner