app/controllers/api/public_albums_controller.rb

  def show
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]

    def must_be_logged_in

      @album = Album.find(params[:id]);
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]