app/controllers/api/public_users_controller.rb

  def show
    @owner = User.find_by(id: params[:user_id])
    @albums = @owner.albums.where(status: 'Published')
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = $1 AND "albums"."status" = $2 ORDER BY event_date DESC  [["user_id", 1], ["status", "Published"]]