app/controllers/api/subalbums_controller.rb

  def show
    @subalbum = Subalbum.includes(:photos).find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def create
    @subalbum = Subalbum.new(subalbum_params)

    if @subalbum.save
---
INSERT INTO "subalbums" ("title", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "u"], ["album_id", 12], ["created_at", "2021-09-06 15:17:56.621851"], ["updated_at", "2021-09-06 15:17:56.621851"]]

    def must_be_subalbum_owner
      if current_user != Subalbum.find(params[:id]).album.owner
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]