app/controllers/album_sessions_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    album = Album.find(params[:album][:id])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @album = Album.find(params[:album])