app/controllers/application_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY event_date DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_album
    if session[:expires_at] < Time.now
      log_out_album!
    else
      album = Album.find_by(id: session[:album_id])

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "6Hmk06oE7L1ti0kahII9og"], ["LIMIT", 1]]
---
  def current_user
    user = User.find_by(session_token: session[:session_token])