app/controllers/static_pages_controller.rb

  def index
    @users = User.order('created_at').limit(3)
---
SELECT "users".* FROM "users" ORDER BY created_at LIMIT $1  [["LIMIT", 3]]