app/models/album.rb

  def create_highlights_subalbum
    @subalbum = self.subalbums.create(title: "Highlights")
---
INSERT INTO "subalbums" ("title", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Highlights"], ["album_id", 12], ["created_at", "2021-09-06 15:15:29.819059"], ["updated_at", "2021-09-06 15:15:29.819059"]]